Revit 2027 API
RouteAnalysisSettings.GetExcludedCategoryIds Method
 Returns ElementIds for Category elements which are excluded (not taken into account) by route calculation. These categories are always excluded, regardless of the EnableIgnoredCategoryIds value. If an excluded category has sub-categories, then the sub-categories will be excluded as well.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetExcludedCategoryIds()
Public Function GetExcludedCategoryIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetExcludedCategoryIds()
member GetExcludedCategoryIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The ids of Categories which are excluded by route calculation.
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace